GopalSaraf/Practicals/PSDL/include/proc/pic12f617.inc
// Register: OPTION_REG
#define OPTION_REG OPTION_REG
OPTION_REG                               equ 0081h
// bitfield definitions
OPTION_REG_PS_POSN                       equ 0000h
OPTION_REG_PS_POSITION                   equ 0000h
OPTION_REG_PS_SIZE                       equ 0003h
OPTION_REG_PS_LENGTH                     equ 0003h
OPTION_REG_PS_MASK                       equ 0007h
OPTION_REG_PSA_POSN                      equ 0003h
OPTION_REG_PSA_POSITION                  equ 0003h
OPTION_REG_PSA_SIZE                      equ 0001h
OPTION_REG_PSA_LENGTH                    equ 0001h
OPTION_REG_PSA_MASK                      equ 0008h
OPTION_REG_T0SE_POSN                     equ 0004h
OPTION_REG_T0SE_POSITION                 equ 0004h
OPTION_REG_T0SE_SIZE                     equ 0001h
OPTION_REG_T0SE_LENGTH                   equ 0001h
OPTION_REG_T0SE_MASK                     equ 0010h
OPTION_REG_T0CS_POSN                     equ 0005h
OPTION_REG_T0CS_POSITION                 equ 0005h
OPTION_REG_T0CS_SIZE                     equ 0001h
OPTION_REG_T0CS_LENGTH                   equ 0001h
OPTION_REG_T0CS_MASK                     equ 0020h
OPTION_REG_INTEDG_POSN                   equ 0006h
OPTION_REG_INTEDG_POSITION               equ 0006h
OPTION_REG_INTEDG_SIZE                   equ 0001h
OPTION_REG_INTEDG_LENGTH                 equ 0001h
OPTION_REG_INTEDG_MASK                   equ 0040h
OPTION_REG_nGPPU_POSN                    equ 0007h
OPTION_REG_nGPPU_POSITION                equ 0007h
OPTION_REG_nGPPU_SIZE                    equ 0001h
OPTION_REG_nGPPU_LENGTH                  equ 0001h
OPTION_REG_nGPPU_MASK                    equ 0080h
OPTION_REG_PS0_POSN                      equ 0000h
OPTION_REG_PS0_POSITION                  equ 0000h
OPTION_REG_PS0_SIZE                      equ 0001h
OPTION_REG_PS0_LENGTH                    equ 0001h
OPTION_REG_PS0_MASK                      equ 0001h
OPTION_REG_PS1_POSN                      equ 0001h
OPTION_REG_PS1_POSITION                  equ 0001h
OPTION_REG_PS1_SIZE                      equ 0001h
OPTION_REG_PS1_LENGTH                    equ 0001h
OPTION_REG_PS1_MASK                      equ 0002h
OPTION_REG_PS2_POSN                      equ 0002h
OPTION_REG_PS2_POSITION                  equ 0002h
OPTION_REG_PS2_SIZE                      equ 0001h
OPTION_REG_PS2_LENGTH                    equ 0001h
OPTION_REG_PS2_MASK                      equ 0004h

// Register: TRISIO
#define TRISIO TRISIO
TRISIO                                   equ 0085h
// bitfield definitions
TRISIO_TRISIO0_POSN                      equ 0000h
TRISIO_TRISIO0_POSITION                  equ 0000h
TRISIO_TRISIO0_SIZE                      equ 0001h
TRISIO_TRISIO0_LENGTH                    equ 0001h
TRISIO_TRISIO0_MASK                      equ 0001h
TRISIO_TRISIO1_POSN                      equ 0001h
TRISIO_TRISIO1_POSITION                  equ 0001h
TRISIO_TRISIO1_SIZE                      equ 0001h
TRISIO_TRISIO1_LENGTH                    equ 0001h
TRISIO_TRISIO1_MASK                      equ 0002h
TRISIO_TRISIO2_POSN                      equ 0002h
TRISIO_TRISIO2_POSITION                  equ 0002h
TRISIO_TRISIO2_SIZE                      equ 0001h
TRISIO_TRISIO2_LENGTH                    equ 0001h
TRISIO_TRISIO2_MASK                      equ 0004h
TRISIO_TRISIO3_POSN                      equ 0003h
TRISIO_TRISIO3_POSITION                  equ 0003h
TRISIO_TRISIO3_SIZE                      equ 0001h
TRISIO_TRISIO3_LENGTH                    equ 0001h
TRISIO_TRISIO3_MASK                      equ 0008h
TRISIO_TRISIO4_POSN                      equ 0004h
TRISIO_TRISIO4_POSITION                  equ 0004h
TRISIO_TRISIO4_SIZE                      equ 0001h
TRISIO_TRISIO4_LENGTH                    equ 0001h
TRISIO_TRISIO4_MASK                      equ 0010h
TRISIO_TRISIO5_POSN                      equ 0005h
TRISIO_TRISIO5_POSITION                  equ 0005h
TRISIO_TRISIO5_SIZE                      equ 0001h
TRISIO_TRISIO5_LENGTH                    equ 0001h
TRISIO_TRISIO5_MASK                      equ 0020h
TRISIO_TRISA0_POSN                       equ 0000h
TRISIO_TRISA0_POSITION                   equ 0000h
TRISIO_TRISA0_SIZE                       equ 0001h
TRISIO_TRISA0_LENGTH                     equ 0001h
TRISIO_TRISA0_MASK                       equ 0001h
TRISIO_TRISA1_POSN                       equ 0001h
TRISIO_TRISA1_POSITION                   equ 0001h
TRISIO_TRISA1_SIZE                       equ 0001h
TRISIO_TRISA1_LENGTH                     equ 0001h
TRISIO_TRISA1_MASK                       equ 0002h
TRISIO_TRISA2_POSN                       equ 0002h
TRISIO_TRISA2_POSITION                   equ 0002h
TRISIO_TRISA2_SIZE                       equ 0001h
TRISIO_TRISA2_LENGTH                     equ 0001h
TRISIO_TRISA2_MASK                       equ 0004h
TRISIO_TRISA3_POSN                       equ 0003h
TRISIO_TRISA3_POSITION                   equ 0003h
TRISIO_TRISA3_SIZE                       equ 0001h
TRISIO_TRISA3_LENGTH                     equ 0001h
TRISIO_TRISA3_MASK                       equ 0008h
TRISIO_TRISA4_POSN                       equ 0004h
TRISIO_TRISA4_POSITION                   equ 0004h
TRISIO_TRISA4_SIZE                       equ 0001h
TRISIO_TRISA4_LENGTH                     equ 0001h
TRISIO_TRISA4_MASK                       equ 0010h
TRISIO_TRISA5_POSN                       equ 0005h
TRISIO_TRISA5_POSITION                   equ 0005h
TRISIO_TRISA5_SIZE                       equ 0001h
TRISIO_TRISA5_LENGTH                     equ 0001h
TRISIO_TRISA5_MASK                       equ 0020h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 008Ch
// bitfield definitions
PIE1_TMR1IE_POSN                         equ 0000h
PIE1_TMR1IE_POSITION                     equ 0000h
PIE1_TMR1IE_SIZE                         equ 0001h
PIE1_TMR1IE_LENGTH                       equ 0001h
PIE1_TMR1IE_MASK                         equ 0001h
PIE1_TMR2IE_POSN                         equ 0001h
PIE1_TMR2IE_POSITION                     equ 0001h
PIE1_TMR2IE_SIZE                         equ 0001h
PIE1_TMR2IE_LENGTH                       equ 0001h
PIE1_TMR2IE_MASK                         equ 0002h
PIE1_CMIE_POSN                           equ 0003h
PIE1_CMIE_POSITION                       equ 0003h
PIE1_CMIE_SIZE                           equ 0001h
PIE1_CMIE_LENGTH                         equ 0001h
PIE1_CMIE_MASK                           equ 0008h
PIE1_CCP1IE_POSN                         equ 0005h
PIE1_CCP1IE_POSITION                     equ 0005h
PIE1_CCP1IE_SIZE                         equ 0001h
PIE1_CCP1IE_LENGTH                       equ 0001h
PIE1_CCP1IE_MASK                         equ 0020h
PIE1_ADIE_POSN                           equ 0006h
PIE1_ADIE_POSITION                       equ 0006h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0040h
PIE1_C1IE_POSN                           equ 0003h
PIE1_C1IE_POSITION                       equ 0003h
PIE1_C1IE_SIZE                           equ 0001h
PIE1_C1IE_LENGTH                         equ 0001h
PIE1_C1IE_MASK                           equ 0008h
PIE1_CCPIE_POSN                          equ 0005h
PIE1_CCPIE_POSITION                      equ 0005h
PIE1_CCPIE_SIZE                          equ 0001h
PIE1_CCPIE_LENGTH                        equ 0001h
PIE1_CCPIE_MASK                          equ 0020h
PIE1_ECCPIE_POSN                         equ 0005h
PIE1_ECCPIE_POSITION                     equ 0005h
PIE1_ECCPIE_SIZE                         equ 0001h
PIE1_ECCPIE_LENGTH                       equ 0001h
PIE1_ECCPIE_MASK                         equ 0020h

// Register: PCON
#define PCON PCON
PCON                                     equ 008Eh
// bitfield definitions
PCON_nBOR_POSN                           equ 0000h
PCON_nBOR_POSITION                       equ 0000h
PCON_nBOR_SIZE                           equ 0001h
PCON_nBOR_LENGTH                         equ 0001h
PCON_nBOR_MASK                           equ 0001h
PCON_nPOR_POSN                           equ 0001h
PCON_nPOR_POSITION                       equ 0001h
PCON_nPOR_SIZE                           equ 0001h
PCON_nPOR_LENGTH                         equ 0001h
PCON_nPOR_MASK                           equ 0002h

