GopalSaraf/Practicals/PSDL/include/proc/pic12f617.inc
// Register: PMDATH
#define PMDATH PMDATH
PMDATH                                   equ 009Dh
// bitfield definitions
PMDATH_PMDATH_POSN                       equ 0000h
PMDATH_PMDATH_POSITION                   equ 0000h
PMDATH_PMDATH_SIZE                       equ 0006h
PMDATH_PMDATH_LENGTH                     equ 0006h
PMDATH_PMDATH_MASK                       equ 003Fh

// Register: ADRESL
#define ADRESL ADRESL
ADRESL                                   equ 009Eh

// Register: ANSEL
#define ANSEL ANSEL
ANSEL                                    equ 009Fh
// bitfield definitions
ANSEL_ANS_POSN                           equ 0000h
ANSEL_ANS_POSITION                       equ 0000h
ANSEL_ANS_SIZE                           equ 0004h
ANSEL_ANS_LENGTH                         equ 0004h
ANSEL_ANS_MASK                           equ 000Fh
ANSEL_ADCS_POSN                          equ 0004h
ANSEL_ADCS_POSITION                      equ 0004h
ANSEL_ADCS_SIZE                          equ 0003h
ANSEL_ADCS_LENGTH                        equ 0003h
ANSEL_ADCS_MASK                          equ 0070h
ANSEL_ANS0_POSN                          equ 0000h
ANSEL_ANS0_POSITION                      equ 0000h
ANSEL_ANS0_SIZE                          equ 0001h
ANSEL_ANS0_LENGTH                        equ 0001h
ANSEL_ANS0_MASK                          equ 0001h
ANSEL_ANS1_POSN                          equ 0001h
ANSEL_ANS1_POSITION                      equ 0001h
ANSEL_ANS1_SIZE                          equ 0001h
ANSEL_ANS1_LENGTH                        equ 0001h
ANSEL_ANS1_MASK                          equ 0002h
ANSEL_ANS2_POSN                          equ 0002h
ANSEL_ANS2_POSITION                      equ 0002h
ANSEL_ANS2_SIZE                          equ 0001h
ANSEL_ANS2_LENGTH                        equ 0001h
ANSEL_ANS2_MASK                          equ 0004h
ANSEL_ANS3_POSN                          equ 0003h
ANSEL_ANS3_POSITION                      equ 0003h
ANSEL_ANS3_SIZE                          equ 0001h
ANSEL_ANS3_LENGTH                        equ 0001h
ANSEL_ANS3_MASK                          equ 0008h
ANSEL_ADCS0_POSN                         equ 0004h
ANSEL_ADCS0_POSITION                     equ 0004h
ANSEL_ADCS0_SIZE                         equ 0001h
ANSEL_ADCS0_LENGTH                       equ 0001h
ANSEL_ADCS0_MASK                         equ 0010h
ANSEL_ADCS1_POSN                         equ 0005h
ANSEL_ADCS1_POSITION                     equ 0005h
ANSEL_ADCS1_SIZE                         equ 0001h
ANSEL_ADCS1_LENGTH                       equ 0001h
ANSEL_ADCS1_MASK                         equ 0020h
ANSEL_ADCS2_POSN                         equ 0006h
ANSEL_ADCS2_POSITION                     equ 0006h
ANSEL_ADCS2_SIZE                         equ 0001h
ANSEL_ADCS2_LENGTH                       equ 0001h
ANSEL_ADCS2_MASK                         equ 0040h

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ADCS0                            BANKMASK(ANSEL), 4
#define ADCS1                            BANKMASK(ANSEL), 5
#define ADCS2                            BANKMASK(ANSEL), 6
#define ADFM                             BANKMASK(ADCON0), 7
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADON                             BANKMASK(ADCON0), 0
#define ANS0                             BANKMASK(ANSEL), 0
#define ANS1                             BANKMASK(ANSEL), 1
#define ANS2                             BANKMASK(ANSEL), 2
#define ANS3                             BANKMASK(ANSEL), 3
#define C1CH                             BANKMASK(CMCON0), 0
#define C1HYS                            BANKMASK(CMCON1), 3
#define C1IE                             BANKMASK(PIE1), 3
#define C1IF                             BANKMASK(PIR1), 3
#define C1OE                             BANKMASK(CMCON0), 5
#define C1ON                             BANKMASK(CMCON0), 7
#define C1OUT                            BANKMASK(CMCON0), 6
#define C1POL                            BANKMASK(CMCON0), 4
#define C1R                              BANKMASK(CMCON0), 2
#define C1SYNC                           BANKMASK(CMCON1), 0
#define C1VREN                           BANKMASK(VRCON), 7
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1IE                           BANKMASK(PIE1), 5
#define CCP1IF                           BANKMASK(PIR1), 5
#define CCP1M0                           BANKMASK(CCP1CON), 0
#define CCP1M1                           BANKMASK(CCP1CON), 1
#define CCP1M2                           BANKMASK(CCP1CON), 2
#define CCP1M3                           BANKMASK(CCP1CON), 3
#define CCPIE                            BANKMASK(PIE1), 5
#define CCPIF                            BANKMASK(PIR1), 5
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CMCH                             BANKMASK(CMCON0), 0
#define CMHYS                            BANKMASK(CMCON1), 3
#define CMIE                             BANKMASK(PIE1), 3
#define CMIF                             BANKMASK(PIR1), 3
#define CMOE                             BANKMASK(CMCON0), 5
#define CMON                             BANKMASK(CMCON0), 7
#define CMPOL                            BANKMASK(CMCON0), 4
#define CMR                              BANKMASK(CMCON0), 2
#define CMSYNC                           BANKMASK(CMCON1), 0
#define CMVREN                           BANKMASK(VRCON), 7
#define COUT                             BANKMASK(CMCON0), 6
#define DC                               BANKMASK(STATUS), 1
#define DCB0                             BANKMASK(CCP1CON), 4
#define DCB1                             BANKMASK(CCP1CON), 5
#define ECCPAS0                          BANKMASK(ECCPAS), 4
#define ECCPAS1                          BANKMASK(ECCPAS), 5
#define ECCPAS2                          BANKMASK(ECCPAS), 6
#define ECCPASE                          BANKMASK(ECCPAS), 7
#define ECCPIE                           BANKMASK(PIE1), 5
#define ECCPIF                           BANKMASK(PIR1), 5
#define FVREN                            BANKMASK(VRCON), 4
#define GIE                              BANKMASK(INTCON), 7
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define GP0                              BANKMASK(GPIO), 0
#define GP1                              BANKMASK(GPIO), 1
#define GP2                              BANKMASK(GPIO), 2
#define GP3                              BANKMASK(GPIO), 3
#define GP4                              BANKMASK(GPIO), 4
#define GP5                              BANKMASK(GPIO), 5
#define GPIE                             BANKMASK(INTCON), 3
#define GPIF                             BANKMASK(INTCON), 0
#define GPIO0                            BANKMASK(GPIO), 0
#define GPIO1                            BANKMASK(GPIO), 1
#define GPIO2                            BANKMASK(GPIO), 2
#define GPIO3                            BANKMASK(GPIO), 3
#define GPIO4                            BANKMASK(GPIO), 4
#define GPIO5                            BANKMASK(GPIO), 5
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOC0                             BANKMASK(IOC), 0
#define IOC1                             BANKMASK(IOC), 1
#define IOC2                             BANKMASK(IOC), 2
#define IOC3                             BANKMASK(IOC), 3
#define IOC4                             BANKMASK(IOC), 4
#define IOC5                             BANKMASK(IOC), 5
#define IOCA0                            BANKMASK(IOC), 0
#define IOCA1                            BANKMASK(IOC), 1
#define IOCA2                            BANKMASK(IOC), 2
#define IOCA3                            BANKMASK(IOC), 3
#define IOCA4                            BANKMASK(IOC), 4
#define IOCA5                            BANKMASK(IOC), 5
#define P1ASEL                           BANKMASK(APFCON), 0
#define P1BSEL                           BANKMASK(APFCON), 1
#define P1M                              BANKMASK(CCP1CON), 7
#define PDC0                             BANKMASK(PWM1CON), 0
#define PDC1                             BANKMASK(PWM1CON), 1
#define PDC2                             BANKMASK(PWM1CON), 2
#define PDC3                             BANKMASK(PWM1CON), 3
#define PDC4                             BANKMASK(PWM1CON), 4
#define PDC5                             BANKMASK(PWM1CON), 5
#define PDC6                             BANKMASK(PWM1CON), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PMADRH0                          BANKMASK(PMADRH), 0
#define PMADRH1                          BANKMASK(PMADRH), 1
#define PMADRH2                          BANKMASK(PMADRH), 2
#define PMADRL0                          BANKMASK(PMADRL), 0
#define PMADRL1                          BANKMASK(PMADRL), 1
#define PMADRL2                          BANKMASK(PMADRL), 2
#define PMADRL3                          BANKMASK(PMADRL), 3
#define PMADRL4                          BANKMASK(PMADRL), 4
#define PMADRL5                          BANKMASK(PMADRL), 5
#define PMADRL6                          BANKMASK(PMADRL), 6
#define PMADRL7                          BANKMASK(PMADRL), 7
#define PMDATL0                          BANKMASK(PMDATL), 0
#define PMDATL1                          BANKMASK(PMDATL), 1
#define PMDATL2                          BANKMASK(PMDATL), 2
#define PMDATL3                          BANKMASK(PMDATL), 3
#define PMDATL4                          BANKMASK(PMDATL), 4
#define PMDATL5                          BANKMASK(PMDATL), 5
#define PMDATL6                          BANKMASK(PMDATL), 6
#define PMDATL7                          BANKMASK(PMDATL), 7
#define PRSEN                            BANKMASK(PWM1CON), 7
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define PSSAC0                           BANKMASK(ECCPAS), 2
#define PSSAC1                           BANKMASK(ECCPAS), 3
#define PSSBD0                           BANKMASK(ECCPAS), 0
#define PSSBD1                           BANKMASK(ECCPAS), 1
#define RA0                              BANKMASK(GPIO), 0
#define RA1                              BANKMASK(GPIO), 1
#define RA2                              BANKMASK(GPIO), 2
#define RA3                              BANKMASK(GPIO), 3
#define RA4                              BANKMASK(GPIO), 4
#define RA5                              BANKMASK(GPIO), 5
#define RD                               BANKMASK(PMCON1), 0
#define RP0                              BANKMASK(STATUS), 5
#define RP1                              BANKMASK(STATUS), 6
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1ACS                            BANKMASK(CMCON1), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GINV                           BANKMASK(T1CON), 7
#define T1GSEL                           BANKMASK(APFCON), 4
#define T1GSS                            BANKMASK(CMCON1), 1
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR1CS                           BANKMASK(T1CON), 1
#define TMR1GE                           BANKMASK(T1CON), 6
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 2
#define TOUTPS0                          BANKMASK(T2CON), 3
#define TOUTPS1                          BANKMASK(T2CON), 4
#define TOUTPS2                          BANKMASK(T2CON), 5
#define TOUTPS3                          BANKMASK(T2CON), 6
#define TRISA0                           BANKMASK(TRISIO), 0
#define TRISA1                           BANKMASK(TRISIO), 1
#define TRISA2                           BANKMASK(TRISIO), 2
#define TRISA3                           BANKMASK(TRISIO), 3
#define TRISA4                           BANKMASK(TRISIO), 4
#define TRISA5                           BANKMASK(TRISIO), 5
#define TRISIO0                          BANKMASK(TRISIO), 0
#define TRISIO1                          BANKMASK(TRISIO), 1
#define TRISIO2                          BANKMASK(TRISIO), 2
#define TRISIO3                          BANKMASK(TRISIO), 3
#define TRISIO4                          BANKMASK(TRISIO), 4
#define TRISIO5                          BANKMASK(TRISIO), 5
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define VCFG                             BANKMASK(ADCON0), 6
#define VR0                              BANKMASK(VRCON), 0
#define VR1                              BANKMASK(VRCON), 1
#define VR2                              BANKMASK(VRCON), 2
#define VR3                              BANKMASK(VRCON), 3
#define VRR                              BANKMASK(VRCON), 5
#define WPU0                             BANKMASK(WPU), 0
#define WPU1                             BANKMASK(WPU), 1
#define WPU2                             BANKMASK(WPU), 2
#define WPU4                             BANKMASK(WPU), 4
#define WPU5                             BANKMASK(WPU), 5
#define WPUA0                            BANKMASK(WPU), 0
#define WPUA1                            BANKMASK(WPU), 1
#define WPUA2                            BANKMASK(WPU), 2
#define WPUA4                            BANKMASK(WPU), 4
#define WPUA5                            BANKMASK(WPU), 5
#define WR                               BANKMASK(PMCON1), 1
#define WREN                             BANKMASK(PMCON1), 2
#define ZERO                             BANKMASK(STATUS), 2
#define nBOR                             BANKMASK(PCON), 0
#define nGPPU                            BANKMASK(OPTION_REG), 7
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nTO                              BANKMASK(STATUS), 4

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC12F617_INC_
